<?php

namespace Database\Seeders\SeedersV2;

use Illuminate\Database\Seeder;
use App\Models\College;

class DepartmentSeederV2 extends Seeder
{
    public function run(): void
    {
        $departments = [
            ['name' => 'هندسة البرمجيات ونظم المعلومات', 'college_id' => 1],
            ['name' => 'الذكاء الاصطناعي', 'college_id' => 1],
            ['name' => 'النظم والشبكات الحاسوبية', 'college_id' => 1],
            ['name' => 'العلوم الأساسية', 'college_id' => 1],


            // //                كلية الطب البشري جامعة دمشق
            // ['name' => 'الطب العام', 'college_id' => 2],
            // //                كلية طب الأسنان جامعة دمشق
            // ['name' => 'طب الأسنان العام', 'college_id' => 3],
            // //                كلية الصيدلة جامعة دمشق
            // ['name' => 'الصيدلة', 'college_id' => 4],
            // //                كلية الآداب جامعة دمشق
            // ['name' => 'لغة عربية', 'college_id' => 5],
            // ['name' => 'لغة انكليزية', 'college_id' => 5],

            // //                كلية الاقتصاد جامعة دمشق
            // ['name' => 'محاسبة', 'college_id' => 6],
            // ['name' => 'إدارة أعمال', 'college_id' => 6],

            // //                كلية العلوم جامعة دمشق
            // ['name' => 'فيزياء', 'college_id' => 7],
            // ['name' => 'الكيمياء', 'college_id' => 7],
            // ['name' => 'الأحياء', 'college_id' => 7],
            // ['name' => 'رياضيات', 'college_id' => 7],


            // //                كلية الهندسة المعلوماتية جامعة حمص
            // ['name' => 'هندسة البرمجيات ونظم المعلومات', 'college_id' => 8],
            // ['name' => 'الذكاء الاصطناعي', 'college_id' => 8],
            // ['name' => 'النظم والشبكات الحاسوبية', 'college_id' => 8],
            // ['name' => 'العلوم الأساسية', 'college_id' => 8],
            // //                كلية الطب البشري جامعة حمص
            // ['name' => 'الطب العام', 'college_id' => 9],
            // //                كلية طب الأسنان جامعة حمص
            // ['name' => 'طب الأسنان العام', 'college_id' => 10],
            // //                كلية الصيدلة جامعة حمص
            // ['name' => 'الصيدلة', 'college_id' => 11],
            // //                كلية الآداب جامعة حمص
            // ['name' => 'لغة عربية', 'college_id' => 12],
            // ['name' => 'لغة انكليزية', 'college_id' => 12],

            // //                كلية الاقتصاد جامعة حمص
            // ['name' => 'محاسبة', 'college_id' => 13],
            // ['name' => 'إدارة أعمال', 'college_id' => 13],

            // //                كلية الآداب جامعة حلب
            // ['name' => 'لغة عربية', 'college_id' => 14],
            // ['name' => 'لغة انكليزية', 'college_id' => 14],

            // //                كلية الاقتصاد جامعة حلب
            // ['name' => 'محاسبة', 'college_id' => 15],
            // ['name' => 'إدارة أعمال', 'college_id' => 15],

            // //                كلية الطب البشري جامعة طرطوس
            // ['name' => 'الطب العام', 'college_id' => 16],
            // //                كلية طب الأسنان جامعة طرطوس
            // ['name' => 'طب الأسنان العام', 'college_id' => 17],
            // //                كلية الصيدلة جامعة طرطوس
            // ['name' => 'الصيدلة', 'college_id' => 18],

            // //                كلية الهندسة المعلوماتية جامعة اللاذقية
            // ['name' => 'هندسة البرمجيات ونظم المعلومات', 'college_id' => 19],
            // ['name' => 'الذكاء الاصطناعي', 'college_id' => 19],
            // ['name' => 'النظم والشبكات الحاسوبية', 'college_id' => 19],
            // ['name' => 'العلوم الأساسية', 'college_id' => 19],
            // //                كلية الآداب جامعة اللاذقية
            // ['name' => 'لغة عربية', 'college_id' => 20],
            // ['name' => 'لغة انكليزية', 'college_id' => 20],

            // //                كلية الاقتصاد جامعة اللاذقية
            // ['name' => 'محاسبة', 'college_id' => 21],
            // ['name' => 'إدارة أعمال', 'college_id' => 21],

            // //                كلية الطب البشري جامعة حماة
            // ['name' => 'الطب العام', 'college_id' => 22],
            // //                كلية الصيدلة جامعة حماة
            // ['name' => 'الصيدلة', 'college_id' => 23],
            // //                كلية الآداب جامعة حماة
            // ['name' => 'لغة عربية', 'college_id' => 24],
            // ['name' => 'لغة انكليزية', 'college_id' => 24],
            // //                كلية الطب البيطري جامعة حماة
            // ['name' => 'الطب العام', 'college_id' => 25],
        ];

        foreach ($departments as $dept) {
            \App\Models\Department::firstOrCreate(
                ['name' => $dept['name'], 'college_id' => $dept['college_id']],
                $dept
            );
        }
    }
}
